## MISSING DATA

In [50]:
import numpy as np
import pandas as pd

In [51]:
data = {
    'A': [1,2,3,4,5,6],
    'B': [1,2,3,4,5,6],
    'C': [1,2,np.nan,4,5,6],
    'D': [1,np.nan,np.nan,4,5,6]
}

In [52]:
df = pd.DataFrame(data)
df

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  NaN
2  3  3  NaN  NaN
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

In [53]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2  False  False   True   True
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [54]:
df.isna().count()

A    6
B    6
C    6
D    6
dtype: int64

In [55]:
df.isna().sum()

A    0
B    0
C    1
D    2
dtype: int64

In [56]:
df.isna().any()

A    False
B    False
C     True
D     True
dtype: bool

In [57]:
df.isna().any(axis = 1)

0    False
1     True
2     True
3    False
4    False
5    False
dtype: bool

*  REMOVING MISSING VALUES

In [58]:
df

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  NaN
2  3  3  NaN  NaN
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

In [59]:
df.dropna()  # Drops all rows that have any NaN values

   A  B    C    D
0  1  1  1.0  1.0
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

In [60]:
df.dropna(thresh=2)   # Drops all rows that have less than 2 non-NaN values

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  NaN
2  3  3  NaN  NaN
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

* FILLING THE MISSING VALUES

In [61]:
df

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  NaN
2  3  3  NaN  NaN
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

In [62]:
df.fillna(0) # Fills all NaN values with 0

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  0.0
2  3  3  0.0  0.0
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

If I want to apply these I Have to write Implace=True

In [63]:
df

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  NaN
2  3  3  NaN  NaN
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

In [64]:
values = {
    'A': 0,
    'B': 100,
    'C': 200,
    'D': 300
}
df.fillna(value=values) # Fills NaN values with different values for each column

   A  B      C      D
0  1  1    1.0    1.0
1  2  2    2.0  300.0
2  3  3  200.0  300.0
3  4  4    4.0    4.0
4  5  5    5.0    5.0
5  6  6    6.0    6.0

In [65]:
df

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  NaN
2  3  3  NaN  NaN
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0

In [66]:
df. fillna(df.mean())

   A  B    C    D
0  1  1  1.0  1.0
1  2  2  2.0  4.0
2  3  3  3.6  4.0
3  4  4  4.0  4.0
4  5  5  5.0  5.0
5  6  6  6.0  6.0